-- Insertar datos en la tabla Brochure
INSERT INTO brochure (BroProCod, BroNumMod)
VALUES
    (0000, 0),
    (1001, 0),
    (1002, 0),
    (1010, 0),
    (1016, 0),
    (1019, 0),
    (1020, 0),

    (1040, 0),

    (1060, 0),
    (1061, 0),

    (1080, 0),
    
    (2010, 0),
    (2020, 0),
    (2030, 0),
    (2040, 0),
    (2050, 0),
    (2060, 0),

    (3010, 0),

    (5000, 0),
    (5001, 0),
    (5010, 0);


INSERT INTO bmodulo (BModCod, BModNomEs, BModNomEn, ModCurCod)
VALUES
    (000001, "modulo 1", "module 1", 0000),

    (100101, "Módulo 1: Gestión Integral", "", 1001),
    (100102, "Módulo 2: Seguridad Laboral", "", 1001),
    (100103, "Módulo 3: Gestión de Riesgos", "", 1001),
    (100104, "Módulo 4: Seguridad Ocupacional", "", 1001),
    (100105, "Módulo 5: Gestión Ambiental y Seguridad", "", 1001),
    (100106, "Módulo 6: Prevención", "", 1001),

    (100201, "Módulo 1: Formación y Entrenamiento", "Module 1:", 1002),
    (100202, "Módulo 2:", "Module 2:", 1002),
    (100203, "Módulo 3:", "Module 3:", 1002),
    (100204, "Módulo 4:", "Module 4:", 1002),
    (100205, "Módulo 5:", "Module 5:", 1002),
    (100206, "Módulo 6:", "Module 6:", 1002),

    (101001, "", "", 1010),

    (101601, "", "", 1016),

    (101901, "", "", 1019),

    (102001, "", "", 1020),

    (104001, "", "", 1040),

    (106010, "", "", 1060),

    (106110, "", "", 1061),

    (108001, "", "", 1080),
    
    (201001, "", "", 2010),
    
    (202001, "", "", 2020),
    
    (203001, "", "", 2030),
    
    (204001, "", "", 2040),
    
    (205001, "", "", 2050),
    
    (206001, "", "", 2060),
    
    (301001, "", "", 3010),
    
    (500001, "", "", 5000),
    
    (500101, "", "", 5001),
    
    (501001, "", "", 5010);